Turinco/sabre/WS_SsoftSabreV2/WS_SsoftSabre/Web References/EndTransactionRQ/EndTransactionLLS1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:tns="https://webservices.sabre.com/websvc" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:xsd1="http://webservices.sabre.com/sabreXML/2003/07" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" targetNamespace="https://webservices.sabre.com/websvc" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xs:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import schemaLocation="EndTransactionLLS1.4.1RQRS.xsd" namespace="http://webservices.sabre.com/sabreXML/2003/07" />
      <xsd:import schemaLocation="msg-header-2_0.xsd" namespace="http://www.ebxml.org/namespaces/messageHeader" />
      <xsd:import schemaLocation="xmldsig-core-schema.xsd" namespace="http://www.w3.org/2000/09/xmldsig#" />
      <xsd:import schemaLocation="xlink.xsd" namespace="http://www.w3.org/1999/xlink" />
      <xsd:import schemaLocation="envelope.xsd" namespace="http://schemas.xmlsoap.org/soap/envelope/" />
      <xsd:import schemaLocation="xml.xsd" namespace="http://www.w3.org/XML/1998/namespace" />
      <xsd:import schemaLocation="wsse.xsd" namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" />
    </xs:schema>
  </types>
  <message name="EndTransactionInput">
    <part name="header" element="eb:MessageHeader" />
    <part name="header2" element="wsse:Security" />
    <part name="body" element="xsd1:EndTransactionRQ" />
  </message>
  <message name="EndTransactionOutput">
    <part name="header" element="eb:MessageHeader" />
    <part name="header2" element="wsse:Security" />
    <part name="body" element="xsd1:EndTransactionRS" />
  </message>
  <portType name="EndTransactionPortType">
    <operation name="EndTransactionRQ">
      <input message="tns:EndTransactionInput" />
      <output message="tns:EndTransactionOutput" />
    </operation>
  </portType>
  <binding name="EndTransactionSoapBinding" type="tns:EndTransactionPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="EndTransactionRQ">
      <soap:operation soapAction="OTA" />
      <input>
        <soap:header message="tns:EndTransactionInput" part="header" use="literal" />
        <soap:header message="tns:EndTransactionInput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </input>
      <output>
        <soap:header message="tns:EndTransactionOutput" part="header" use="literal" />
        <soap:header message="tns:EndTransactionOutput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </output>
    </operation>
  </binding>
  <service name="EndTransactionService">
    <port name="EndTransactionPortType" binding="tns:EndTransactionSoapBinding">
      <soap:address location="https://webservices.sabre.com/websvc" />
    </port>
  </service>
</definitions>